Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཨུད་པ་ལ་གཉིས་བཅོམ་ལྡན་འདས་ལ་གཏོར་ནས་དེ་གཉིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སྙན་གྱི་གོང་དུ་ཤིང་རྟའི་འཕང་ལོ་ཙམ་གྱིས་བླ་རེར་ཆགས་ཤིང་འདུག་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: After she scattered her two blue lotuses over the Blessed One, they were also blessed so that they transformed into two canopies the size of chariot wheels over the Blessed One’s ears.

source: ས་ཕྱོགས་དེ་དག་ཀྱང་རྫི་ཆར་དྲག་པོ་ཆེན་པོས་འདམ་རྫབ་ཏུ་གྱུར་ནས། དེའི་འོག་ཏུ་ས་ཕྱོགས་འདམ་རྫབ་ཅན་དེར་བཅོམ་ལྡན་འདས་གཤེགས་པ་ན།
en: “The strong, gusty rain had turned the whole area to mud, and as the Blessed One started to walk across the muddy area,

source: བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོས་ས་ཕྱོགས་འདམ་རྫབ་ཅན་དེར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྐྲ་བཏིང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: the young brahmin Sumati spread his hair on the muddy ground before the Blessed One, and said in verse,

source: བློ་ལྡན་སད་མཛད་གལ་ཏེ་བདག །བྱང་ཆུབ་ཏུ་ནི་འཚང་རྒྱ་ནསྐྱེ་རྒ་མེད་མཛད་ཞབས་གཉིས་ཀྱིས། །མྱུར་དུ་བདག་སྐྲ་བརྫི་བར་གསོལ། །
en: “ ‘O brilliant Awakened One— That I might awake, I request You with your ageless, unborn feet Upon my hair to quickly tread.’

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དེས། བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོའི་སྐྲའི་སྟེང་དུ་ཞབས་གཉིས་བཞག་གོ། །
en: “Then the totally and completely awakened Buddha Dīpaṃkara placed his feet upon the young brahmin Sumati’s hair.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོའི་ཕྱི་བཞིན་འབྲང་ཞིང་འདུག་པ་དེ་ཁྲོས་ནས།
en: “Then Mati, who had accompanied the young brahmin Sumati and sat with him, said in anger,

source: ཀྱེ་ལྟོས་དང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་འདིས། བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོའི་སྐྲ་ཕྱུགས་ལ་བྱ་བ་བཞིན་དུ་བརྫིས་ས་ཞེས་ཟེར་རོ། །
en: ‘See how the totally and completely awakened Buddha Dīpaṃkara tramples the hair of this young brahmin as if it were an animal hide!’

source: དེ་ནས་དེའི་འོག་ཏུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་ལུང་བསྟན་ཏེ།
en: Then the totally and completely awakened Buddha Dīpaṃkara issued the following prophecy of the young brahmin Sumati’s awakening:

source: ཁྱོད་ནི་ས་འདིར་འཇིག་རྟེན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །སྟོན་པ་མངའ་བདག་འཇིག་རྟེན་གསུམ་ལས་རྣམ་གྲོལ་བ། །ཤཱཀྱའི་སྲས་པོ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ། །འཇིག་རྟེན་གསུམ་གྱི་སྙིང་པོ་འགྲོ་བའི་སྒྲོན་དུ་འགྱུར། །
en: “ ‘For the good of all the world, at this very place you will Become the teacher, the sovereign, liberated from the triple world, The Śākya prince who shall be known as Śākyamuni, Beating heart of the triple world and a lamp for beings.’

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་ལུང་བསྟན་མ་ཐག་པ་དེའི་མོད་ཁོ་ན་ལ་ནམ་མཁའ་ལ་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་འཕགས་སོ། །
en: “The very moment that the totally and completely awakened Buddha Dīpaṃkara prophesied of the young brahmin Sumati’s awakening, Sumati rose into the sky to the height of seven palm trees.

source: དེ་ནས་དེའི་སྐྲ་བྱི་ནས་སྐྲ་སར་ཁྱད་པར་དུ་འཕགས་པ་བྱུང་ངོ་། །
en: His old hair fell away, and in its place a halo of new hair appeared.

source: དེ་ནས་དེ་ནམ་མཁའ་ལ་འདུག་པ་སྐྱེ་བོ་ཕལ་པོ་ཆེས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་སྨོན་ལམ་བཏབ་པ།
en: The great crowd saw him hovering in the sky, and they began to pray,

source: གང་གི་ཚེ་འདིས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་པར་འགྱུར་བ་དེའི་ཚེ་བདག་ཅག་འདིའི་ཉན་ཐོས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: ‘When he achieves unexcelled wisdom, may we become his disciples.’

source: བུ་མོ་དེས་ཀྱང་སྨོན་ལམ་བཏབ་སྟེ།
en: The young woman also recited the following prayer:

source: ཁྱོད་ཀྱིས་གང་དུ་སྨོན་པ་ཡི། །འདྲེན་པ་སངས་རྒྱས་བརྙེས་པ་དེར། །
en: “ ‘Whenever your prayers are fulfilled And you become a guide, a buddha,

source: རྟག་ཏུ་འཐུན་པར་ཆོས་སྤྱོད་པའི། །ཁྱོད་ཀྱི་བཙུན་མོར་བདག་གྱུར་ཅིག། །
en: May I be your queen—a constant aide To your practice of Dharma.

source: གང་ཚེ་ཁྱོད་ནི་རྫོགས་སངས་རྒྱས། །འཇིག་རྟེན་གཙོ་བོ་རྣམ་འདྲེན་འགྱུར། །
en: ‘When the day dawns that you wholly Awaken and become the chief Who guides the world,

source: དེ་ཡི་དུས་བབ་ཁྱོད་ཀྱི་ནི། །ཉན་ཐོས་མར་ཡང་བདག་གྱུར་ཅིག །
en: May I become your disciple too.

source: མཁའ་གནས་བྲམ་ཟེའི་ཁྱེའུ་མཐོང་ནས། །བརྒྱ་ཕྲག་དང་ནི་སྟོང་ཕྲག་རྣམས། །
en: “ ‘Now hundreds and thousands watch as A young brahmin sits in the sky.

source: ཐམས་ཅད་མ་འོངས་དུས་དག་ཏུ། །ཉན་ཐོས་ཉིད་དུ་སྨོན་པར་བྱེད། །
en: Below, all of them make wishes One day to be your disciple.

source: གང་ཚེ་ཁྱོད་ནི་རྫོགས་སངས་རྒྱས། །འཇིག་རྟེན་གཙོ་བོ་རྣམ་འདྲེན་འགྱུར། །དེ་ཡི་དུས་བབ་ཁྱོད་ཀྱི་ནི། །ཉན་ཐོས་བདག་ཅག་འགྱུར་བར་ཤོག །
en: “ ‘When the day dawns that you wholly Awaken and become the chief Who guides the world—when that time comes, May we all become your disciples.’

source: དེ་ནས་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་ལུང་བསྟན་པ་དེའི་ཚེ། རྒྱལ་པོ་མར་མེས་དེའི་སྐྲ་བླངས་ནས་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུས་སྨྲས་པ།
en: “King Dīpa picked up the hair that had fallen away after the totally and completely awakened Buddha Dīpaṃkara had prophesied about the young brahmin Sumati’s awakening, and King Vāsava said,

source: སྐྲ་འདི་དག་བདག་ལ་བྱིན་ཅིག །
en: ‘Give me that hair.’

source: དེ་ནས་རྒྱལ་པོ་མར་མེས་སྐྲ་དེ་དག་དེ་ལ་བྱིན་ནས་དེས་བླངས་ཏེ།
en: King Dīpa gave the hair to him, and King Vāsava took it and counted it.

source: བགྲངས་ན་སྐྲ་ཉག་མ་བརྒྱད་ཁྲི་བྱུང་ངོ་། །
en: There were eighty thousand strands of hair,

source: དེ་ནས་རྒྱལ་པོ་དེའི་བློན་པོ་རྣམས་ཀྱིས་གསོལ་པ།
en: so the king’s ministers beseeched him,

source: ལྷ་བདག་ཅག་ལ་སྐྲ་ཉག་མ་རེ་རེ་སྩལ་བར་གསོལ། འོན་ཀྱང་བདག་ཅག་གིས་དེ་རྣམས་མཆོད་རྟེན་དུ་བགྱི་བར་འཚལ་ལོ། །
en: ‘Deva, we would like to request that you give each of us one strand of hair, for we wish to make stūpas of them.’

source: དེ་ནས་རྒྱལ་པོ་དེས་བློན་པོ་དེ་དག་ལ་སྐྲ་ཉག་མ་རེ་རེ་བྱིན་ནས་བློན་པོ་དེ་དག་རང་རང་གི་ཡུལ་དུ་སོང་སྟེ་མཆོད་རྟེན་བརྩིགས་སོ། །
en: “The king gave a strand of hair to each of his ministers, who returned to their provinces and built stūpas.

source: གང་གི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེའི་ཚེ། རྒྱལ་པོ་མར་མེ་དང་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུ་དང་གྲོང་ཁྱེར་གྱི་མི་དང་ཡུལ་གྱི་མི་དུ་མས་མ་འོངས་པའི་དུས་ཀྱི་ཡོན་ཏན་ལ་བལྟས་ཏེ་ཡོ་བྱད་ཐམས་ཅད་བསྟབས་སོ། །དེ་ནས་བློ་གྲོས་བཟང་པོས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་ལ་སྨྲས་པ།
en: When the young brahmin Sumati’s unexcelled, total, and complete enlightenment was prophesied, King Dīpa, King Vāsava, and the inhabitants of the cities and the countryside, seeing the great good that would come of building the stūpas, provided all that was necessary for the ministers to do so.

source: ང་ནི་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ན་ཁྱོད་ཀྱིས་གང་དུ་སེམས་བསྐྱེད།
en: “Then Sumati asked the young brahmin Mati, ‘What was going through your mind as he prophesied my unexcelled, total, and complete enlightenment?’

source: དེས་སྨྲས་པ། བདག་ནི་མ་རུང་ངོ་། །
en: “ ‘What I thought wasn’t right,’ he replied.

source: བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོས་སྨྲས་པ། ཁྱོད་ཀྱིས་ཅི་ཞིག་བྱས་ན། མ་རུང་བར་འགྱུར།
en: “ ‘What was so wrong about it?’ asked the young brahmin Sumati.

source: དེས་སྨྲས་པ། གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་ཞབས་ཀྱིས་ཁྱོད་ཀྱི་སྐྲ་བརྫིས་པ་དེའི་ཚེ། བདག་ཁྲོས་ཏེ་སྨྲས་པ།
en: “ ‘I got angry when the totally and completely awakened Buddha Dīpaṃkara stepped on your hair, and I said,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས། བྲམ་ཟེའི་སྐྲ་ཕྱུགས་ལ་བྱ་བ་བཞིན་དུ་རྐང་པས་བརྫིས་སོ་ཞེས་བྱས་སོ། །
en: ‘See how the totally and completely awakened Buddha Dīpaṃkara tramples the young brahmin Sumati’s hair with his foot as if it were an animal hide!’

source: དེ་ནས་བློ་གྲོས་བཟང་པོས་དེ་ལ་སྨྲས་པ། ཚུར་ཤོག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་རབ་ཏུ་འབྱུང་བར་བྱའོ། །
en: “Sumati replied, ‘Come! Let us go forth in the presence of the Blessed Buddha.’

source: དེ་ནས་བློ་གྲོས་བཟང་པོ་དང་བློ་གྲོས་གཉིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: Sumati and Mati both went forth in the teaching of the totally and completely awakened Buddha Dīpaṃkara.

source: བློ་གྲོས་བཟང་པོ་ནི་རབ་ཏུ་བྱུང་ནས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ་ཆོས་བཞིན་དུ་འཁོར་བསྡུས་སོ། །
en: Having gone forth, Sumati studied the Tripiṭaka and gathered disciples in accord with the Dharma.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེས་སོ། །
en: Then the young brahmin Sumati died, transmigrated, and took rebirth in the Tuṣita Heaven.

source: བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་ནི་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་སེམས་ཅན་དམྱལ་བར་སྐྱེས་སོ། །
en: As for the young brahmin Mati, after he died, he transmigrated and took rebirth as a hell being.

source: དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ
en: I am the one who was the young brahmin Sumati then, and who was established in the bodhisattva practice.

source: ངས་དེར་སངས་རྒྱས་མར་མེ་མཛད་ལ་ཨུད་པ་ལ་སྔོན་པོ་དག་གིས་མཆོད་པ་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། འཁོར་བ་ན་བདེ་བ་ཆེན་པོ་མྱོང་བར་གྱུར་ཏེ།
en: The act of my offering blue lotuses to Buddha Dīpaṃkara ripened and caused me to experience great happiness in saṁsāra.

source: དགེ་བའི་རྩ་བ་དེས་ན་ངའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་རྐྱེན་ཙམ་དང་ཚོགས་ཙམ་དུ་གྱུར་ལ་ད་ལྟའི་བར་དུ་ཡང་ལས་དེའི་རྣམ་པར་སྨིན་པས་མཛའ་སྡེ་བོ་ལྔ་བརྒྱ་པོ་རྣམས་ཀྱིས་འདི་ལྟ་བུའི་མཆོད་པ་བྱས་པ་ཡིན་ནོ།། །།
en: That root of virtue became the sole cause, condition, and accumulation of my unexcelled, total, and complete enlightenment, and up to this day the ripening of that action is the reason that the band of five hundred friends have made offerings to me in the same way.”

source: འཇིགས་མེད་ཅེས་བྱ་བ་ནི།
en: The Story of Abhaya

source: བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པ་ནས་རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་པ་ལས། རི་ཁྲོད་ཅིག་ཏུ་བྱོན་ནས་དེ་དེར་གཤེགས་པ་ན། ཤིང་གི་གྲིབ་མ་ལ་སྐད་ཅིག་མཉེལ་བསོ་ནས་ཆས་ཏེ་གཤེགས་སོ། །
en: As the Blessed One was traveling from Śrāvastī to Rājagṛha, he came to a certain place in the wilderness where, under the shade of the trees, he paused to rest a moment before continuing.

source: ལམ་དེ་ཡང་སེང་གེའི་འཇིགས་པ་ཆེན་པོ་དང་ལྡན་པ་ཞིག་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ལམ་ཁ་གཉིས་སུ་གྱེས་པ་མཐོང་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་གསོལ་ཏོ། །
en: Up ahead, Venerable Ānanda saw a fork in the path. There was great danger of lions on the path, so he asked the Blessed One,

source: བཙུན་པ་ཤུལ་འདི་ནི་ཁ་གཉིས་སུ་གྱེས་ཏེ།
en: “Lord, the road forks here.

source: དེ་ལ་ཤུལ་གཅིག་ནི་དྲང་ལ་འཇིགས་པ་དང་བཅས་པ་ལགས།
en: One way is direct but dangerous;

source: ཤུལ་གཅིག་ནི་འཁྱོག་ལ་འཇིགས་པ་མ་མཆིས་པ་ལགས་ན།
en: the other is meandering but safe.

source: བཙུན་པ་ཤུལ་གང་དུ་གཤེགས་པར་མཛད།
en: Lord, by which path should we proceed?”

source: ཀུན་དགའ་བོ་གང་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བཞུགས་པ་དེ་ན་ནི། འཇིགས་པའམ་སྐྲག་པའམ་བག་ཚ་བ་ཅི་ཡང་མེད་ཀྱིས་ལམ་དྲང་པོ་ལོགས་སུ་དྲོངས་ཤིག་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Ānanda, wherever the tathāgatas, the arhats, the totally and completely awakened buddhas dwell there is nothing to fear, and no need to be scared or anxious, so lead us down the direct path.”

source: གྲོང་མིའི་བྱིས་པ་གཉིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་ཐག་མི་རིང་བ་ཞིག་ན་རྩེ་ཞིང་འདུག་སྟེ།
en: Two children from the village were playing not far from where the Blessed One stood.

source: དེ་གཉིས་ལ་གཅིག་ནི་རྔེའུ་ཆུང་ཐོགས་སོ། །
en: One of them was holding a tiny drum.

source: གཅིག་ནི་མདའ་གཞུ་ཐོགས་སོ། །
en: The other clasped a bow and arrow.

source: དེ་ནས་ཁྱེའུ་དེ་གཉིས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ་རྒྱང་ནས་མཐོང་ངོ་། །
en: The two of them saw the Blessed One from a distance, graced and resplendent with the thirty-two excellent marks of a great person.

source: མཐོང་ནས་ཀྱང་དགའ་བ་སྐྱེས་སོ། །
en: They looked at the Blessed Buddha, and the sight of him filled them with happiness.

source: དགའ་བ་སྐྱེས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Happily they approached the Blessed One, and when they arrived they touched their heads to the Blessed One’s feet and requested of him,

source: བཙུན་པ་ཤུལ་འདི་ན་སེང་གེའི་འཇིགས་པ་ནི་མཆིས་མོད་ཀྱི། འོན་ཀྱང་བཅོམ་ལྡན་འདས་གཤེགས་པ་དང་། བདག་ཅག་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་བསེལ་བགྱི་བར་འཚལ་ལོ། །
en: “Lord, though there is great danger of lions on this path, please allow us to escort the Blessed One.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེའུ་ཁྱོད་གཉིས་ཀྱིས་སེང་གེའི་འཇིགས་པ་བྱུང་ན་ཇི་ལྟར་བྱ།
en: The Blessed One asked, “Children, what will you do if the threat of lions becomes imminent?”

source: དེར་གཅིག་གིས་གསོལ་པ། བཙུན་པ་བདག་གིས་རོལ་མོའི་སྒྲས་སྐྲག་པར་བགྱིའོ། །
en: The first one replied, “Lord, I’ll scare them with the sound of my drum!”

source: གཅིག་གིས་གསོལ་པ། བདག་གིས་ནི་མདའ་གཞུའི་སྒྲས་སྐྲག་པར་བགྱིའོ། །
en: And the other replied, “I’ll scare them with the sound of my bow and arrow!”

source: ཁྱེའུ་དེ་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་མདུན་ལོགས་སུ་ཆས་སོ། །
en: The children walked on ahead of the Blessed One,

source: འདི་གཉིས་ཀྱིས་ནི་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་ཟིན་ཏོ་སྙམ་དུ་དགོངས་ནས་
en: “These two have already produced roots of virtue.”

source: བཀའ་སྩལ་པ། ཁྱེའུ་ཁྱེད་གཉིས་ཀྱིས་སེམས་དགའ་བ་བསྐྱེད་པ་དེ་ཙམ་གྱིས་བསེལ་བྱས་ཟིན་ཏེ་
en: With this thought, the Blessed One told them, “Children, by your mere happiness the two of you have already escorted me to safety.

source: ཆོག་གིས་ཕྱིར་དེངས་ཤིག །དེ་ནས་ཁྱེའུ་དེ་གཉིས་ཕྱིར་ལོག་ནས།
en: You may be on your way now,” and the two children departed.

source: བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་དེ་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེའི་ཚེ་ཞལ་ནས་འོད་ཟེར་སྔོན་པོ་དང་སེར་པོ་དང་དམར་པོ་དང་དཀར་པོ་རྣམས་བྱུང་ནས་ཁ་ཅིག་ནི་འོག་ཏུ་འགྲོའོ། །ཁ་ཅིག་ནི་སྟེང་དུ་འགྲོའོ། །
en: At that moment, the Blessed One smiled. Now it is the nature of the blessed buddhas’ smiles that when they smile, colorful beams of blue, yellow, red, and white light radiate from their mouths, with some traveling up and others traveling down.

source: འོག་ཏུ་འགྲོ་བ་གང་ཡིན་པ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བ་ཡང་སོས་དང་ཐིག་ནག་དང་འདུས་འཇོམས་དང་ངུ་འབོད་དང་ངུ་འབོད་ཆེན་པོ་དང་ཚ་བ་དང་རབ་ཏུ་ཚ་བ་དང་མནར་མེད་པ་དང་ཆུ་བུར་ཅན་དང་ཆུ་བུར་རྡོལ་དང་སོ་ཐམས་ཐམས་དང་ཀྱི་ཧུད་ཟེར་དང་ཨ་ཆུ་ཟེར་དང་ཨུད་པལ་ལྟར་གས་པ་དང་པད་མ་ལྟར་གས་པ་དང་པད་མ་ལྟར་གས་པ་ཆེན་པོར་སོང་ནས
en: Those that travel down go to the beings in the Reviving Hell, the Black Thread Hell , the Crushing Hell, the Shrieking Hell, the Screaming Hell, the Hot Hell, the Hell of Extreme Heat, the Hell of Ceaseless Agony, the Blistering Hell, the Bursting Blister Hell, the Hell of Chattering Teeth, the Hell of Lamentation, the Cold Whimpering Hell, the Splitting Open Like a Blue Lotus Hell, the Splitting Open Like a Lotus Hell, and the Splitting Open Like a Great Lotus Hell,

source: དེས་ནས་སེམས་ཅན་དེ་དག་གི་གནོད་པའི་ཁྱད་པར་རྣམས་རྩེ་ཞིལ་བར་གྱུར་ཏོ། །དེ་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: In this way they soothe the particular injuries of those beings, who wonder,

source: ཀྱེ་བདག་ཅག་ནི་འདི་ནས་ཀྱང་ཤི་འཕོས་པར་མ་གྱུར་ལ། །གཞན་དུ་ཡང་མ་སྐྱེས་མོད་ཀྱི།
en: “Alas, it is neither that we have died and left this place, nor that we have been born elsewhere.

source: ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་གང་དུ་བདེན་པ་རྣམས་ཀྱི་སྣོད་དུ་རུང་བར་འགྱུར་བ་དེར་ཉིང་མཚམས་འཛིན་པར་གྱུར་ཏོ། །
en: Now, as fit vessels of the truths, they take rebirth among the gods and humans.

source: སྟེང་དུ་འགྲོ་བ་གང་ཡིན་པ་དེ་དག་ནི་རྒྱལ་ཆེན་བཞིའི་རིས་རྣམས་དང་སུམ་ཅུ་རྩ་གསུམ་པ་རྣམས་དང་འཐབ་བྲལ་རྣམས་དང་དགའ་ལྡན་རྣམས་དང་འཕྲུལ་དགའ་རྣམས་དང་གཞན་འཕྲུལ་དབང་བྱེད་རྣམས་དང་ཚངས་རིས་རྣམས་དང་ཚངས་པའི་མདུན་ན་འདོན་པ་རྣམས་དང་ཚངས་པ་ཆེན་པོ་རྣམས་དང་འོད་ཆུང་རྣམས་དང་ཚད་མེད་འོད་རྣམས་དང་འོད་གསལ་རྣམས་དང་
en: The rays of light that travel up go to the following gods: those of the Abodes of the Four Great Kings, the Heaven of the Thirty-Three, the Strifeless Heaven, Tuṣita Heaven, the Delighting in Creation Heaven, the Heaven of the Masters of Others’ Creations, and the Heaven of Brahmā’s Assembly; those of the realms called Brahmin Priests, Great Brahmā, Limited Splendor, Immeasurable Splendor, Radiant Heaven,

source: དགེ་ཆུང་རྣམས་དང་། ཚད་མེད་དགེ་རྣམས་དང་དགེ་རྒྱས་རྣམས་དང་སྤྲིན་མེད་རྣམས་དང་བསོད་ནམས་སྐྱེས་རྣམས་དང་འབྲས་བུ་ཆེ་རྣམས་དང་མི་ཆེ་རྣམས་དང་མི་གདུང་རྣམས་དང་གྱ་ནོམ་སྣང་རྣམས་དང་ཤིན་ཏུ་མཐོང་རྣམས་དང་འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་བར་དུ་སོང་ནས
en: Lesser Virtue, Immeasurable Virtue, Extensive Virtue, and the Cloudless Heaven; and those of the realms called Increasing Merit, Great Result , None Greater, Sorrowless, Sublime Vision, Great Vision, and Supreme .

source: མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་སྟོང་པ་དང་བདག་མེད་པའི་སྒྲ་སྒྲོགས་སོ། །
en: There they sound a cry of impermanence, suffering, emptiness, and selflessness,

source: ཡང་ཚིགས་སུ་བཅད་དེ་གསོལ་བ།
en: He then supplicated him with the following verses:

source: ཐུབ་པ་ཁྱུ་མཆོག་གི་ནི་གསུང་མཆོག་བསྟན་པ་དང་། །བཟང་པོ་དག་གིས་ཐེ་ཚོམ་སྐྱེས་པ་བསལ་བར་གསོལ། །
en: O sage , greatest of the herd, with speech unrivaled, sure, and good, Reassure those prone to doubt.

source: དེ་ནི་དེ་བཞིན་ཏེ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་མེད་རྐྱེན་མེད་པར་འཛུམ་པ་མི་མཛད་དེ།
en: “It is just as you say, Ānanda. Without the right causes and conditions the tathāgatas, the arhats, the totally and completely awakened buddhas do not smile.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ང་ལ་འདི་ལྟ་བུའི་བཀུར་སྟི་བྱས་པ་མཐོང་ངམ།
en: Ānanda, did you see those two children who offered to serve me?”

source: ཀུན་དགའ་བོ་ཁྱེའུ་འདི་གཉིས་དགེ་བའི་རྩ་བ་དང་སེམས་བསྐྱེད་པ་དང་སྦྱིན་པར་བྱ་བའི་ཆོས་ཡོངས་སུ་གཏོང་བ་འདིས། བསྐལ་པ་བཅུ་གསུམ་གྱི་བར་དུ་ལོག་པར་ལྟུང་བར་མི་འགྱུར་ཏེ
en: “Ānanda, by the roots of the virtue of these children’s actions, the happiness they felt toward me, and the wholeheartedness of their generosity, they will not fall to the lower realms for thirteen eons.

source: རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ཏེདེ་ལ་གཅིག་ནི་རང་སངས་རྒྱས་རྔ་སྒྲ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: One will manifest the enlightenment of a solitary buddha and become the solitary buddha known as Dundubhisvara, and the other will be known as Abhaya.

source: གཅིག་ནི་འཇིགས་མེད་ཅེས་བྱ་བར་འགྱུར་ཏེ་དེ་གཉིས་ཀྱི་སྦྱིན་པར་བྱ་བའི་ཆོས་ནི་འདི་ཡིན་ནོ།། །།
en: That is what shall come of their act of generosity.”

source: དབྱིག་མཚོ་ཞེས་བྱ་བ་ནི།
en: The Story of Lake of Jewels

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་
en: When the Blessed One was in Śrāvastī, there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་གང་གི་ཚེ་བུ་ཆགས་པར་གྱུར་པ་དེའི་ཚེ་དེ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་གྱུར་ལ།
en: One day his wife conceived, and when she did she found herself suddenly adorned by all manner of adornments.

source: ཁང་བཟངས་ཐམས་ཅད་དུ་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་སྟེ།
en: Parasols, banners, and flags fluttered from the top of the palatial house;

source: མེ་ཏོག་སྣ་ཚོགས་ནི་བཀྲམ་སྤོས་ཆུས་ནི་ཆག་ཆག་བཏབ་པའི་ནང་ན།
en: different kinds of flowers had been strewn and sundry fragrances sprinkled about;

source: མལ་ཁྲི་ལ་འདུག་སྟེ་བུད་མེད་ཀྱི་འཁོར་གྱིས་བསྐོར་ཅིང་འདུག་གོ། །
en: and as she sat upon her bed she found she was surrounded by a retinue of women.

source: དེ་ནས་ཁྱིམ་བདག་དེས་བསམས་པ། མ་ལ་བདག་གི་ཆུང་མ་འདི་འབྱུང་པོ་འགའ་ཞིག་གིས་ཐེབས་པར་མ་གྱུར་གྲང་སྙམ་ནས་ལྟས་མཁན་རྣམས་ལ་བསྟན་ན།
en: “Oh my! Has my wife been possessed by a ghost?” the householder wondered, and he brought her to the soothsayers.

source: ལྟས་མཁན་རྣམས་ན་རེ་འདི་ནི་འབྱུང་པོས་ཐེབས་པ་མ་ཡིན་གྱི།
en: “No,” the soothsayers told him, “she has not been possessed by a ghost.

source: སེམས་ཅན་ལྟོ་ན་འདུག་པ་དེའི་མཐུ་ཡིན་ནོ་ཞེས་ཟེར་རོ། །
en: All this has taken place on account of the being in her womb.”

source: དེ་ནས་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། མངལ་གྱི་དྲི་མ་དང་ཤ་མའི་དྲི་མ་དང་ཁྲག་གི་དྲི་མས་མ་གོས་པ་ཞིག་བཙས་ནས
en: Then after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, beautiful, and decorated with adornments, who bore no trace of the womb, or of the placenta, or of blood.

source: དེ་བུད་མེད་དེ་དག་གིས་བཀྲུ་བར་འདོད་དེ་རྒྱན་བཀྲོལ་ན་དེའི་རྒྱན་གཞན་བྱུང་སྟེ།
en: Every time the women wanted to bathe him and would remove one of his adornments, another would appear.

source: བཀྲོལ་ཏེ་བོར་ཡང་གཞན་བྱུང་བར་གྱུར་ནས་
en: When they so much as loosened one and moved it aside, another would appear in its place.

source: མས་སྨྲས་པ། རྒྱན་འདི་ནི་འདི་ཡི་བསོད་ནམས་ལས་སྐྱེས་པ་ཡིན་གྱིས།
en: “These adornments have arisen as a result of his merit,” his mother told them.

source: མ་བཀྲོལ་བར་རྒྱན་དང་བཅས་པར་ཁྲུས་ཤིག་ཅེས་བྱས་སོ། །
en: “Don’t remove them. Just wash him with the adornments on.”

source: དེ་ནས་བུད་མེད་དེ་དག་གིས་རྒྱན་དང་བཅས་ཏེ་
en: So the nurses bathed him with the adornments on.

source: བཀྲུས་ནས་མལ་ཁྲིའི་སྟེང་དུ་བཞག་པ་དང་། དེའི་མིའི་མལ་ཁྲི་མི་སྣང་བར་གྱུར་ནས་ལྷའི་མལ་ཁྲི་བྱུང་བར་གྱུར་ཏོ། །
en: When they placed him on his bed it disappeared and a celestial bed appeared in its place.

source: ཁང་བཟངས་དེ་ཉིད་དུ་ཡང་དེའི་ལྷའི་ཁང་པ་བརྩེགས་པ་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་བ། མེ་ཏོག་སྣ་ཚོགས་བཀྲམ་པ་སྤོས་ཆུས་ཆག་ཆག་བཏབ་པ་བྱུང་བར་གྱུར་ཏོ། །
en: Also, in place of their palatial home, there appeared a multistoried celestial palace, with fluttering parasols, banners, and flags, and different kinds of flowers and fragrances strewn and sprinkled all about.

source: ཁང་པ་བརྩེགས་པ་དེའི་ནང་གི་མལ་ཁྲིའི་སྔས་སུ་ཡང་ལྷའི་མཆོད་སྡོང་རིལ་གྱིས་གསེར་ལས་བྱས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་བྱུང་ངོ་། །
en: In that multistoried palace, on the pillows of his celestial bed, a divine pillar appeared as well, made of gold inlaid with precious stones.

source: མཆོད་སྡོང་དེའི་དྲུང་ནས་ཀྱང་གཏེར་ཆེན་པོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་གང་བ་ཁ་བྱེ་བ་བཞི་བྱུང་སྟེ། གལ་ཏེ་དེ་དག་ལས་བརྒྱ་འམ་སྟོང་བྱུང་དུ་ཟིན་ཀྱང་། དེ་དག་འགྲིབ་པའམ་གང་བར་ཡང་མི་མངོན་ནོ། །
en: In front of the pillar four great treasures appeared, brimming with jewels that never seemed to increase or decrease, even if hundreds or thousands of them were removed.

source: དེ་ནས་ཕ་མ་གཉིས་ཀྱིས་མཐོང་མ་ཐག་ཏུ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: When his parents saw all this they were ecstatic.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?”

source: ཁྱེའུ་འདི་བཙས་པ་ན་ཁྱིམ་འདི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་མཚོ་བཞིན་དུ་གང་བར་གྱུར་པས་ན། དེའི་ཕྱིར་ཁྱེའུ་འདིའི་མིང་དབྱིག་མཚོ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since the house filled up like a lake of jewels when this child was born, his name will be Lake of Jewels.”

source: དེ་ནས་ཁྱེའུ་དབྱིག་མཚོ་པང་ན་འཚོ་བའི་མ་མ་གཉིས་དང་ནུ་མ་སྣུན་པའི་མ་མ་གཉིས་དང་དྲི་མ་འཁྲུ་བའི་མ་མ་གཉིས་དང་རྩེ་བའི་མ་མ་གཉིས་ཏེ་མ་མ་བརྒྱད་ལ་གཏད་ནས་
en: Young Lake of Jewels was brought up by eight nurses—two nurses to hold him in their laps, two wet nurses, two nurses to bathe him, and two nurses to play with him.

source: དེ་མ་མ་བརྒྱད་ཀྱིས་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་དང་བུད་མེད་རྨ་བྱའི་མདོངས་ཆང་པ་ན་ཐོགས་པ་དང་བསྲུང་བའི་སྲད་བུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ཏེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared him on milk, yogurt, butter, ghee, and milk solids. They raised him with a protection cord and the eye of a female peacock feather, and he flourished like a lotus in a lake.

source: དེ་གང་དུ་འགྲོ་བ་དེར་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་དེ་ལ་རས་སར་པ་མ་སྤྱད་པ་ཚར་ཚར་རིང་བ་རྣམས་ས་ལ་བཏིང་བར་བྱེད་དོ། །
en: Wherever he walked, nonhuman spirits unfurled great lengths of new, untouched cloth

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱང་ས་ལ་འགྲེམས་པར་བྱེད་དོ། །
en: and strewed different kinds of flowers on the ground before him.
